; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v5)
		(pred_4 ?v7)
		(pred_5 ?v1)
		(pred_1 ?v1)
		(pred_6 ?v7 ?v1)
		(pred_2)
		(pred_3 ?v7))

   (:action op_1
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_5 ?v2) (pred_5 ?v8) (pred_1 ?v2))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v2))))


   (:action op_3
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_6 ?v3 ?v6) (pred_1 ?v6) (pred_2))
       :effect (and (pred_3 ?v3)
		    (not (pred_6 ?v3 ?v6)) 
		    (not (pred_2))))

   (:action op_2
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_3 ?v3) (pred_1 ?v6))
       :effect (and (pred_6 ?v3 ?v6)
		    (pred_2)
		    (not (pred_3 ?v3)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_03 obj_02 obj_05 
          obj_04 obj_06 obj_01 
)
(:init
(pred_5 obj_03)
(pred_5 obj_02)
(pred_5 obj_05)
(pred_4 obj_04)
(pred_4 obj_06)
(pred_4 obj_01)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(pred_2)
(pred_6 obj_04 obj_05)
(pred_6 obj_06 obj_03)
(pred_6 obj_01 obj_05)
(pred_1 obj_02)
)
(:goal
(and
(pred_6 obj_04 obj_03)
(pred_6 obj_06 obj_05)
(pred_6 obj_01 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_04 obj_03) (pred_1 obj_02))
    (sometime-before  (pred_6 obj_06 obj_05) (pred_1 obj_02))
    (sometime-before  (pred_6 obj_01 obj_02) (pred_1 obj_03))
  )
)
)

; plan
1. (op_1 obj_02 obj_05)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_05)
   goals met: 0 of 3
2. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04 obj_05) (pred_2)
   added: (pred_3 obj_04)
   goals met: 0 of 3
3. (op_1 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 0 of 3
4. (op_2 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_6 obj_04 obj_03) (pred_2)
   goals met: 1 of 3
5. (op_3 obj_06 obj_03)
   deleted: (pred_6 obj_06 obj_03) (pred_2)
   added: (pred_3 obj_06)
   goals met: 1 of 3
6. (op_1 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 1 of 3
7. (op_2 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_6 obj_06 obj_05) (pred_2)
   goals met: 2 of 3
8. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_01 obj_05) (pred_2)
   added: (pred_3 obj_01)
   goals met: 2 of 3
9. (op_1 obj_05 obj_02)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_02)
   goals met: 2 of 3
10. (op_2 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_02) (pred_2)
   goals met: 3 of 3
